{
  "Entrance Room": "The room is dark and empty. It almost looks like a cave, except that is has a certain *geometry*. It is not quite rectangular but, then again, too regular to be of natural origin. You are certain that it is man-made. Or made by some inexplainable intelligence.",

  "Large Foyer": "You are in a room that is so high you cannot see the ceiling. If it were not for the haunting darkness above you'd be sure that it had no ceiling at all. The walls of the room are narrow and, in contrast to the dauting height, almost crushing.",

  "Debris Room": "Whatever used to be in this room, it is gone now. Left of it is only rubble and trash and what seems to be remains of ... something. Yes, those are bones, you're sure of that, but they aren't exactly *human*. And you're not sure whether they're from any animal you have ever seeen.",

  "Water Chamber": "There is a small pond in the middle of the room. It seems impossibly deep and yet you can see a light coming from the inside. It draws you near, but when you step closer, you feel fear. There is something inside of it, something that might be important.",

  "Hall of Mists": "There is a thick fog in the air. You are not sure if it's an entirely natural phenomenon because it somehow seems to stop at the rooms doors. It smells like musk and lemon, a scent you know very well. But from where you don't remember.",

  "Dark Room": "Darkness. That is all you can say about this room. Even though none of the other rooms had lights or torches, they seemed well-enough illuminated. This one, however, is completely dark. You shouldn't be able to move around, and yet you *know*.",

  "Abandoned Shrine": "In the center of the room you see an old altar, a shrine to long forgotten gods and idols. It is engraved with stange symbols, a language you don't read. You can feel a *power* coming from the altar. An old power. It feels primeval. Almost older than time itself.",

  "Pit Room": "You are in a small room. In its center is a bottomless pit that makes it hard to move around safely. You don't know how deep it goes nor do you have any desire to find out. Whatever is down there should stary where it is.",

  "Mysterious Cavern": "You are in a cave complex. This can hardly be called a room and for the first time you have stumbled upon a part of this complex that is not man-made. The cave walls glow in vibrant colors, coming from gemstones embedded in the stone."
}
